Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: རས་ཀྱི་སྐུད་པའམ་པདྨའི་སྐུད་པ་བཻ་ཌཱུརྱའི་ཁ་དོག་ལྟ་བུར་ཚོན་གྱིས་ཁ་བསྒྱུར་བར་བགྱི་ཞིང་ཁྲུ་ཉི་ཤུ་རྩ་གཅིག་བཀལ་ཏེ། དེ་ལ་ཡང་པདྨ་བགྱིས་ཏེ།
en: He should procure the right type of thread for the noose—either cotton or lotus thread dyed the color of beryl and cut to the measure of twenty-one cubits.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་འདབ་མ་ཁ་ཕྱེ་བ་སོར་བཞི་བའི་ཚད་ཀྱིས་པདྨ་གསེར་གྱི་འདབ་མ་དང་།
en: The lotus should be made from the three types of precious material, and its petals should be open and measure four fingers.

source: དངུལ་གྱི་འདབ་མ་དང་། བཻ་ཌཱུརྱ་དང་།
en: The material to be used for the petals should be gold plate or silver plate.

source: ཨིན་དྲ་ནཱི་ལ་དང་། རིན་པོ་ཆེ་ཀ་ཏི་ཀ་ལས་བགྱི་ཞིང་མུ་ཏིག་གིས་བསྐོར་བ་བགྱི་སྟེ།
en: Its kernels should be made of either beryl or sapphire and surrounded by pearl.

source: དེ་ནས་ཞགས་པ་ལ་བཏགས་པར་བགྱིའོ། །ཞགས་པའི་ཐོར་ཏོ་གཅིག་ལ་ནི་པདྨའི་ཕྱག་རྒྱ་གདགས་པར་བགྱིའོ།
en: The lotus should then be attached to the noose, and the hand at the opposite side should display the noose mudrā. “

source: །དེ་ནས་ལེགས་པར་བརྒྱན་པའི་ཆོས་ཀྱི་སྟན་བཟང་པོ་བཤམ་པར་བགྱིའོ།
en: The vidyā holder should then prepare a divine seat adorned as the Dharma seat and draw a circle with cow dung.

source: །བའི་ལྕི་བས་དཀྱིལ་འཁོར་བགྱིས་ལ་དཀྱིལ་འཁོར་གྱི་སྟེང་དུ་དྲིའི་པདྨ་བསམས་པར་བགྱི་ཞིང་། དཀྱིལ་འཁོར་གྱི་སྟེང་དུ་ཆོས་ཀྱི་སྟན་བཤམས་ལ།
en: Above the circle he should visualize a lotus rich in fragrance and place the Dharma seat within the circle.

source: བུམ་པ་གང་བས་བརྒྱན་པར་བགྱིའོ། །མེ་ཏོག་གི་སིལ་མ་བཀྲམ་ཞིང་ཨ་ག་རུ་དང་། ཙན་དན་དང་། དུ་རུ་སྐའི་བདུག་པ་དབུལ་བར་བགྱིའོ།
en: He should adorn the circle with full jars, strew it with flowers, and burn incense of agarwood, sandalwood, and olibanum in front of it.

source: །མཆོད་ཡོན་དང་ཞབས་བསིལ་གྱི་སྣོད་ཀྱང་གཞག་པར་བགྱིའོ།
en: He should also set out argha water for the feet.

source: །པདྨའི་ཞགས་པ་དེ་ཡང་ཆོས་ཀྱི་སྟན་གྱི་སྟེང་དུ་གཞག་པར་བགྱིའོ།
en: The lotus noose should be placed on the Dharma seat. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་དུ་རིག་སྔགས་འཆང་གིས་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་ཁྲི་བཟླས་ཏེ།
en: The vidyā holder should sit cross-legged in front of the painting of Noble Avalokiteśvara and recite the heart mantra of Amoghapāśa ten thousand times, incanting with each recitation a single mustard seed and throwing it on the noose until he has reached the number ten thousand.

source: བཟླས་པའི་ཡུངས་ཀར་རེ་རེ་ནས་དེའི་སྟེང་དུ་གཏོར་བར་བགྱིའོ། །ལན་ཁྲི་རྫོགས་ནས་དེ་ནས་ཚེས་བཅྭ་ལྔའི་ཟླ་བ་ཉ་བའི་ནུབ་མོ་མཆིས་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པ་བགྱིའོ། །ཞགས་པ་དེ་ལ་ཡང་མཆོད་པར་བགྱིའོ།
en: On the fifteenth lunar day, the day of the full moon, after fasting for one day and one night, he should make offerings to Noble Avalokiteśvara and to the noose.

source: །དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་བཅིངས་ནས་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླའོ། །དེ་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ།
en: Then, displaying the mudrā of Amoghapāśa, he should recite the heart mantra of Amogharāja one hundred and eight times and, after that, the heart mantra of Krodharāja one hundred and eight times.

source: ཉིན་མཚན་གསུམ་དུས་གསུམ་དུ་བཟླས་བརྗོད་དང་མཆོད་པ་བགྱིའོ།
en: He should recite at the three junctions of the day and make offerings.

source: །དེ་ནས་པདྨའི་ཞགས་པ་འབར་ཞིང་ཁ་དོག་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་འབྱུང་བར་འགྱུར་རོ།
en: The lotus noose will then blaze with light of various colors, and the words ‘Good!

source: །ལེགས་སོ་ལེགས་སོ་ཞེས་བགྱི་བའི་ཚིག་འབྱིན་པར་འགྱུར་རོ།
en: It is good!’ will be heard.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ལུས་ལ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་འབྱུང་བར་འགྱུར་རོ།
en: The painting of Noble Avalokiteśvara will also radiate light of various colors.

source: །དེ་ནས་རིག་སྔགས་འཆང་ཕྱག་རྒྱའི་སྐྱིལ་མོ་ཀྲུང་གིས་མཆིས་ནས་མིག་མི་འཛུམས་ཤིང་བཞིན་འཛུམ་པས་སྙིང་རྗེ་ཆེན་པོ་ཡིད་ལ་བསྒོམ་པར་བགྱིའོ།
en: At that time, the vidyā holder, displaying the mudrā, should sit in the cross-legged posture without blinking, with a smiling countenance and his heart filled with great compassion.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གདོང་དུ་བལྟ་སྟེ། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་སུམ་སྟོང་བཟླས་པར་བགྱིའོ།
en: Looking at Noble Avalokiteśvara’s face, he should recite the heart mantra of Amoghapāśa three times. “

source: །དེའི་འོག་ཏུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བདག་ཉིད་ཀྱི་ལྷའི་རང་བཞིན་མདུན་དུ་མཆིས་ནས།
en: After this, Noble Avalokiteśvara will appear before the vidyā holder in his true divine nature.

source: ལག་པ་གཡས་པ་བརྐྱང་སྟེ་རིག་སྔགས་འཆང་གི་སྤྱི་བོར་བཞག་ནས་ལེགས་སོ་ཞེས་བགྱི་བ་སྩོལ་བར་འགྱུར་ཞིང་། འདི་སྐད་ཅེས་ཀྱང་དབུགས་འབྱིན་པར་འགྱུར་རོ། །རིག་སྔགས་འཆང་ངའི་བུ་སྙིང་ལས་སྐྱེས་པའི་ཐུ་བོ།
en: He will extend his right arm, place his hand on the vidyā holder’s head, and applaud and comfort him, saying, ‘You, a vidyā holder, are my eldest son and very close to me.

source: བཟླས་བརྗོད་ཀྱི་ཆོ་ག་ཆེན་པོ་དང་། མཆོད་པའི་ཆོ་ག་ཆེན་པོ་འདིས་ང་ལ་མཆོད་པའི་མཆོག་བྱས་པ་དང་།
en: This great ritual procedure of recitation and offerings constitutes my ultimate worship.

source: བཟླས་བརྗོད་ཀྱི་མཆོད་དང་གྲུབ་པའི་མཆོག་སྟེ།
en: This is the supreme way of reciting, and the supreme practice.

source: ཁྱོད་ཀྱིས་དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་གྲུབ་ཅིང་། ཁྱོད་ཀྱིས་པདྨའི་ཞགས་པ་ཆེན་པོ་གྲུབ་ཀྱིས།
en: You have accomplished the heart mantra of Amogharāja and mastered the practice of the great lotus-noose.

source: ཅི་ལྟར་ཡིད་ལ་བསམས་པ་བཞིན་དུ་མཆོག་ཁྱེར་ཅིག །ཁྱོད་ཀྱིས་ཡིད་ཀྱི་བརྣག་པ་ཐམས་ཅད་ནི་ཡོངས་སུ་རྫོགས་པར་བྱས།
en: You have obtained the desired boons and fulfilled all your wishes.

source: ཁྱོད་འཁོར་བའི་འཇིགས་པ་རྒྱུ་བ་ལས་ནི་གྲོལ།
en: You are freed from the dreadful prison of saṃsāra.

source: ཁྱོད་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བའི་མྱ་ངན་མི་བཟད་པའི་འཇིགས་པ་ལས་ཐར་ན།
en: You are freed from the terrible fears of birth, old age, death, and despair.

source: ཁྱོད་དམྱལ་བ་ཆེན་པོ་མི་བཟད་པ་བཅུ་དྲུག་ལས་ནི་ཡོངས་སུ་གྲོལ།
en: You are saved from the sixteen great and terrible hells.

source: འཇིགས་པ་ཆེན་པོ་མི་བཟད་པའི་སྡུག་བསྔལ་གྱི་ཚོར་བ་བརྒྱད་ལས་ནི་ཡོངས་སུ་ཐར།
en: You are saved from the eight great fears and from terrible suffering and pain.

source: འདི་ནས་ཕྱི་མའི་སྐྱེ་བའི་མངལ་དུ་གནས་ནས་སྡུག་བསྔལ་མི་བཟད་པ་ལས་ཤི་འཕོས་ཏེ།
en: This is your last birth from a womb with its dreadful suffering.

source: རིག་སྔགས་འཆང་ཁྱོད་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: After you die, O vidyā holder, you will proceed to the realm of Sukhāvatī, where you will be spontaneously born from a lotus flower. This will continue until you attain the ultimate and final awakening.

source: །ཁྱོད་ཀྱི་གང་གཱའི་ཀླུང་འབུམ་ཕྲག་སྟོང་བརྒྱད་ཅུ་རྩ་བཞི་སྙེད་ཀྱི་བྱེ་མ་དང་མཉམ་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་ཆེར་བསྐྱེད་པའི་བསོད་ནམས་ཀྱི་ཚོགས་ཆེན་པོ་དང་ནི་ལྡན།
en: You have planted roots of great virtue in the presence of eighty-four billion tathāgatas equal in number to the grains of sand in the Gaṅgā river. Your store of merit, O vidyā holder, is huge.

source: རིག་སྔགས་འཆང་ཁྱོད་ཀྱིས་ལྷག་པར་བྱ་བ་མང་པོ་ནི་བྱས།
en: You have performed many acts of respectful service.

source: ཁྱོད་རིག་སྔགས་འཆང་ཆེན་པོར་ནི་ལུང་བསྟན།
en: You, O great vidyā holder, are prophesied to attain liberation.

source: དམྱལ་བ་དང་། ངན་སོང་གི་ལས་ཀྱི་སྒྲིབ་པ་མི་བཟད་པ་ཐམས་ཅད་ལས་ནི་གྲོལ་གྱིས།
en: You are saved from all the terrors of the hells and cleansed of all your past obscurations.

source: ཅི་ལྟར་ཡིད་ལ་བསམས་པ་བཞིན་མཆོག་ཁྱེར་ཅིག །
en: You may request whatever boon comes to mind.’ “

source: དེ་ནས་རིག་སྔགས་འཆང་གིས་ཅི་ལྟར་ཡིད་ལ་བསམས་པ་བཞིན་དེའི་ཚེ་མཆོག་ཐོབ་པར་འགྱུར་རོ།
en: At this point the vidyā holder will obtain a boon according to his wish.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་པདྨའི་ཞགས་པ་དེ་བླངས་ཏེ་གནས་གཙང་མར་གུས་པས་མཆོད་པ་རྒྱ་ཆེར་བགྱིའོ།
en: He should grasp the lotus noose and, in a clean place, make copious offerings with reverence.

source: །ནམ་དགོས་པ་དེའི་ཚེ་ཞགས་པ་བླང་བར་བགྱིའོ། །ལས་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: Whenever a task needs to be performed, he should grasp the noose with his hand; he will then be able to perform any task.

source: །པདྨ་ནི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ལག་པ་གཡོན་པར་བཞག་ལ། ལག་པ་གཡས་པས་ཞགས་པ་བཟུང་སྟེ། དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ནས།
en: He should place the lotus in the left hand of Noble Avalokiteśvara, grasp the noose with the right hand, and recite the heart mantra of Amogharāja one hundred and eight times.

source: སེམས་ཅན་ནམ་ལྷ་གང་གི་མིང་ནས་བརྗོད་དེ། བཟླས་བརྗོད་བརྒྱ་རྩ་བརྒྱད་ཚང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མདུན་ན་མཆིས་ནས།
en: Whatever being or deity’s name he focuses on while reciting the mantra, that being will arrive in front of the bodhisattva when the number one hundred and eight has been reached.

source: འདོད་པའི་མཆོག་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ།
en: The bodhisattva will grant that being all the desired boons. “

source: །དེ་ནས་རིག་སྔགས་འཆང་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དོན་དུ་གཉེར་བར་འཚལ་ན། རིག་སྔགས་འཆང་གཙང་མས་ལེགས་པར་ཁྲུས་བགྱིས་ཏེ།
en: If the vidyā holder wants his future awakening to be prophesied, he should be well bathed and clean and wear clean clothes.

source: གོས་གཙང་མ་བགོས་པས་ཉིན་ཞག་གཅིག་མཆིས་པར་གྱུར་པས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བགྱིས་ནས། པདྨའི་ཞགས་པ་དེ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱག་ཏུ་དབུལ་བར་བགྱིའོ།
en: After fasting for one day and one night, he should offer a large pūjā to the blessed Buddha Śākyamuni and place the lotus noose in the blessed Buddha’s hand.

source: །ཞགས་པའི་ཐོར་ཏོ་ཡ་གཅིག་གིས་ནི་རང་གི་མགུལ་དུ་བཏགས་ལ་དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ལན་སྟོང་རྩ་བརྒྱད་ཚང་བར་བཟླས་བརྗོད་བགྱིའོ། །སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་།
en: He should tie the other end of the noose to his own neck and recite the heart mantra of Amogharāja the full one thousand and eight times.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་གསེར་གྱི་མདོག་ཅན་རིག་སྔགས་འཆང་གི་མདུན་དུ་བཞུགས་ནས་རིག་སྔགས་འཆང་གི་སྤྱི་བོར་ཕྱག་བཞག་སྟེ་དབུགས་འབྱིན་པར་མཛད་ལུང་སྟོན་པར་མཛད་ཡིད་ཀྱི་བརྣག་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མཛད་པར་འགྱུར་རོ།
en: When this number is reached, the blessed Buddha will arrive before the vidyā holder in his golden body and place his hand on the vidyā holder’s head. He will comfort him, prophesy his future awakening, and make all his wishes come true.

source: །སྒྲིབ་པ་དང་སྡིག་པ་ཚེ་རབས་སྟོང་དུ་བསགས་པ་ཐམས་ཅད་གཏུགས་པར་འགྱུར། ལྷག་མ་མ་ལུས་པར་གཏུགས་པར་གྱུར་ནས།
en: He will remove all his wrongdoings and obscurations accumulated over hundreds of thousands of his former births; they will be exhausted completely. “

source: ལུས་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: The body of the vidyā holder will become completely pure.

source: །དྲི་མ་དང་བྲལ་ཞིང་ཕྲག་དོག་དང་། སེར་སྣ་སྤངས་པར་འགྱུར་རོ།
en: His stains will be removed, and his envy and jealousy will be gone.

source: །འདི་ནས་མ་འོངས་པའི་སྐྱེ་བའི་མངལ་དུ་གནས་ནས།
en: His current birth will be his last birth from a womb.

source: ལྷ་དང་མིའི་དཔལ་ཉམས་སུ་མྱོང་བར་བགྱིས་ནས།
en: He will experience the splendor of the celestial realms.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བླ་མ་གཅིག་པུར་འགྱུར་རོ། །མཆོད་པར་འོས་པ་དང་། བླ་མའི་གནས་སུའང་འགྱུར་རོ། །ནད་རྣམས་དང་བྲལ་བར་འགྱུར་རོ།
en: All beings will treat him as their unique master and offer due worship.

source: །སྐྱེ་བོ་ཐམས་ཅད་དགའ་བར་འགྱུར་རོ། །འགུམ་པའི་དུས་སུ་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དགོངས་པར་འགྱུར། དབུགས་འབྱིན་པར་མཛད། ལེགས་པའི་ལམ་སྟོན་པར་ཡང་མཛད་པར་འགྱུར་རོ།
en: The tathāgatas in the ten directions will think about him at the time of his death, offer him comfort, and show him the right path.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མདུན་ན་མཆིས་ནས་དབུགས་འབྱིན་པར་བགྱིད་ཅིང་ལག་པ་གཡས་པ་སྤྱི་བོར་འཇོག་པར་བགྱིད་དོ།
en: Noble Avalokiteśvara, too, will appear before him and give him comfort, placing his right hand on his head.

source: །དེ་བདེ་བས་ཤིན་ཏུ་དྲན་པ་ཉེ་བར་བཞག་ནས་ལུས་འདོར་བར་འགྱུར་རོ།
en: He will leave his body while facing Noble Avalokiteśvara, who will be aware of his presence.

source: །བོར་བ་ཙམ་གྱི་མོད་ལ་སྐལ་བ་མཉམ་པར་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: As soon as he dies he will, as is his destiny, proceed to the realm of Sukhāvatī, where he will be spontaneously born from a lotus flower.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ནས། མཚན་དང་དཔེ་བྱད་ཀྱིས་སྤྲས་པའི་ལུས་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: His body will be adorned with all the ornaments, including the major and minor marks of perfection.

source: །ཚེ་རབས་དྲན་པར་འགྱུར་ཏེ། བསྐལ་པ་བརྒྱ་སྟོང་གི་སྐྱེ་བའི་ཚེ་རབས་དྲན་པར་འགྱུར་རོ།
en: He will recover the memories of his former births, going back in time hundreds of thousands of eons, and this Heart Essence of Amoghapāśa—this maṇḍala of liberation, the ritual text complete with its collection of mudrās—will remain prominent in his memory.

source: །དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་ཕྱག་རྒྱ་རིམ་པར་དབྱེ་བའི་ཆོ་ག་ཞིབ་མོ་འདི་མཐའ་དག་རྫོགས་པར་གཡར་ཐོན་དུ་བགྱིས་ནས་ས་བཅུ་ལ་གནས་ཤིང་ཕྱིན་ཅི་ལོག་ཏུ་མ་གྱུར་པས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་དང་།
en: He will be irreversibly established on the ten bodhisattva levels, from where there is no turning back.

source: ཆོ་འཕྲུལ་ཆེན་པོས་ལྷའི་ཁང་པ་བརྩེགས་པ་དང་། གཞལ་མེད་ཁང་དང་། གནས་མཆོག་དང་། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནས། སངས་རྒྱས་ཀྱི་ཞིང་དུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་མཆི་བར་འགྱུར་རོ།
en: Until the moment of his ultimate and final awakening, he will travel through all the buddha fields in the ten directions, from one to another, living in supremely great residences and celestial palaces that have been miraculously created through great magical power. “

source: །དེ་ནས་རིག་སྔགས་འཆང་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་བའི་ཆོས་ཁོ་ན་ལ་བལྟ་བར་འཚལ་ན། རིག་སྔགས་འཆང་གིས་གནས་གཙང་མའི་ཕྱོགས་སམ། གནས་སམ། ཁང་པའམ། དགོན་པའི་གནས་སམ།
en: If the vidyā holder wants to see the realm of Sukhāvatī just as he sees this temporal world, he should draw a four-sided maṇḍala in a clean place in a house, forest, park, garden pavilion, or a walking area, on a mountaintop, or in a hut.

source: འཁོར་གྱི་ཁྱམས་སམ།
en: It should be drawn in a clean spot on the ground with a smooth, well-swept surface.

source: འཆག་སའམ། ཁང་པ་བརྩེགས་པའམ། སྤྱིལ་པོ་གཙང་མ་ཕྱི་བརྡར་ལེགས་པར་བགྱིས་པའི་ས་ཕྱོགས་སུ་དཀྱིལ་འཁོར་གྲུ་བཞི་འབྱེས་པ་ཁྲུ་གང་བའམ། ཁྲུ་དོ་པའི་དཀྱིལ་འཁོར་བགྱི་སྟེ། གྲུ་བཞི་ལྷམ་པ།
en: The maṇḍala should be one or two cubits across, regular in shape, and with four corners and four sides.

source: གྲྭ་ཀུན་ནས་ཆ་མཛེས་པ། ས་དང་སྦྱར་བའི་ལྕི་བས་ཤིན་ཏུ་ལེགས་པར་ཕྱི་བརྡར་བགྱིས་ལ།
en: It should be daubed with a mixture of clay and cow dung, have a smooth surface, and be adorned with green and tender medicinal grass.

source: རྩྭ་སྔོན་པོ་གཉེན་པོ་ལྟ་བུ་ལ་མཁས་པས་དཀྱིལ་འཁོར་མཐའ་དག་གི་ཆ་དབྱེ་བའི་ཐིག་གདབ་པར་བགྱིའོ།
en: Using thread, the skilled vidyā holder should demarcate the sections of the maṇḍala, the perimeter, and the central area.

source: །དཀྱིལ་འཁོར་གྱི་དབུས་ཀྱི་སྙིང་བོ་ལ་པདྨ་རྒྱ་ཆེན་པོ་འབྱེས་པ་འདབ་མ་བརྒྱ་པ།
en: In the central area he should use paints of vivid colors to expertly draw a lotus with one hundred petals and one hundred and eight kernels. “

source: ཚོན་སྣ་བརྒྱད་ཀྱི་ཚོན་རྩིས་བཀྲ་བར་བགྱི་ཞིང་མཛེས་པར་བགྱིས་ལ།
en: Around the perimeter of the lotus he should draw various circular motifs and lotuses in a variety of colors, each four fingers in size.

source: སྙིང་པོ་ནི་རིན་པོ་ཆེ་ཀ་ཏི་ཀ་ལས་བགྱིའོ། །པདྨའི་མཐའ་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བསྐོར་ལ། གྲྭ་བཞི་ནས་ཁ་ཁྱེར་སོར་བཞི་པའི་ཚད་དུ་བགྱིའོ། །པདྨའི་བར་གྱི་ཟུར་ཟུར་དུ་ཨུཏྤལ་སྔོན་པོ་ལེགས་པར་བྲིས་ལ།
en: He should draw beautiful blue lotuses in the inner corners of the main lotus and a circular jeweled platform around it.

source: ཁ་ཁྱེར་གྱི་ཕྱི་རོལ་དུ་ནོར་བུས་འཁོར་བའི་མཐའ་དེ་མཚོས་བསྐོར་བར་བགྱིའོ། །ལྷའི་ཆབ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་གཞལ་མེད་ཁང་གིས་མཛེས་པར་བགྱིས་ལ།
en: He should draw a surrounding ocean filled with divine water and palaces made of various jewels.

source: ཆབ་ལ་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་སིལ་མ་བཀོད་པ་བྱ་རྣམ་པ་སྣ་ཚོགས་གནས་འཆའ་བ་ངང་པ་དང་། བཞད་དང་། ཁྲུང་ཁྲུང་དང་། ངུར་བ་དང་། ཤང་ཤང་ཏེའུ་དང་།
en: The ocean’s waters should be strewn with various flowers and contain many nesting birds such as geese, cranes, curlews, cakravāka birds, jīvaka birds, cuckoos, and various other birds.

source: ཀ་ལ་པིང་ཀ་དང་། བྱའི་ཚོགས་ཀྱིས་མཛེས་པར་བགྱིས་ལ། ཉ་དང་ཆུ་སྲིན་དང་། ཆུ་སྲིན་བྱིས་པ་གསོད་ཀུན་ནས་རྟེན་འཆའ་བར་བགྱིད་དོ།
en: It should be filled with fish, crocodiles, and dolphins.

source: །མཚོའི་འགྲམ་ན་རིན་པོ་ཆེའི་ལྗོན་ཤིང་དང་། མེ་ཏོག་གི་ལྗོན་ཤིང་དང་། འབྲས་བུའི་ལྗོན་ཤིང་དང་། སྣ་ཚོགས་པ་ཁ་ཁྱེར་དང་བཅས་པར་བགྱིའོ།
en: On the ocean’s shore he should draw various jewel trees, blossom-bearing trees, and fruit trees provided with benches.

source: །དཀྱིལ་འཁོར་གྱི་ཁ་ཁྱེར་གྱི་ཕྱི་རོལ་ན་ལག་པ་དང་ཐལ་མོའི་ཕྱག་རྒྱ་བྲིས་ལ་སྒོ་བཞི་རྣམས་སུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བགྱིའོ།
en: Outside the circular platform, he should draw hand mudrās and implements. The Four Great Kings should stand at the four gates.

source: །དེ་ནས་དབུས་ཀྱི་དཀྱིལ་འཁོར་ལ་པདྨའི་གདན་བཟང་པོ་བཤམས་ཏེ་དེའི་སྟེང་དུ། བཅོམ་ལྡན་འདས་འོད་དཔག་མེད་དང་།
en: A divine seat should be depicted on the lotus in center of the maṇḍala, with the blessed Amitābha seated upon it.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་མཐུ་ཆེན་ཐོབ་གཞག་པར་བགྱིའོ།
en: The vidyā holder should also draw Noble Avalokiteśvara and Mahā­sthāma­prāpta. “

source: །དཀྱིལ་འཁོར་བུམ་པ་གང་བས་བརྒྱན་པར་བགྱིའོ། །མེ་ཏོག་སིལ་མ་དང་། དྲི་དང་བྱུག་པ་ཡང་དབུལ་བར་བགྱིའོ། །བ་དན་བཟང་པོ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པར་བགྱིའོ།
en: The maṇḍala should be adorned with full jars, strewn with flowers, smeared with scented oils, and adorned with various divine banners.

source: །གཏོར་མ་དཀར་པོ་དབུལ་བར་བགྱིའོ། །ཡོན་ཆབ་དང་ཞབས་བསིལ་གྱི་སྣོད་དང་། མར་མེའི་ཕྲེང་བ་དབུལ་བར་བགྱིའོ།
en: The vidyā holder should offer a bali consisting of ‘white’ foods, drinking water, argha water for the feet, and a row of lamps.

source: །པདྨའི་ཞགས་པ་འོད་དཔག་མེད་ཀྱི་ཕྱག་ཏུ་དབུལ་བར་བགྱིའོ།
en: He should place the lotus at the end of the lotus noose in Amitābha’s hand.

source: །རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོ་བར་བགྱིའོ།
en: Clean, well washed, and wearing clean clothes, he should sprinkle himself with the five products of the cow.

source: །ལེགས་པར་ཁྲུས་བགྱིས་ནས་བའི་རྣམ་ལྔས་ཉེ་རེག་བགྱིས་ལ་ཟླ་བ་ཉ་ལ་ཉིན་ཞག་གཅིག་མཆིས་པར་གྱུར་པས་ཁ་ཤར་ཕྱོགས་སུ་བལྟས་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་མཆིས་ནས། ལག་པས་ཞགས་པའི་ཕྱག་རྒྱ་བཅིངས་ཏེ་བཟླས་བརྗོད་བགྱིའོ།
en: On the day of the full moon, after fasting for one day and night, he should sit cross-legged with his face toward the east while displaying the noose mudrā with his hand and reciting the heart mantra of Amoghapāśa.

source: །བྱམས་པ་དང་བརྩེ་བའི་སེམས་ཀྱིས་ལྷག་པར་བརྩོན་པར་བགྱིའོ། །སྙིང་རྗེས་མཆོག་ཏུ་བརྩེ་བར་གྱུར་པས་སེམས་ཅན་ཐམས་ཅད་ལ་བརྩེ་བར་བགྱིད་ན།
en: Dedicated to caring and feeling pity for all beings, he should cultivate loving kindness and compassion.

source: དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་བརྗོད་བགྱིས་ཏེ། ཅི་ཙམ་ན་ཐུན་ཐ་མ་ལ། འོད་དཔག་མེད་འབར་བར་གྱུར་ནས།
en: He should thus carry on reciting the heart mantra of Amoghapāśa until, in the last watch of the night, Amitābha will blaze with light.

source: དཀྱིལ་འཁོར་ཆེན་པོ་དེ་ལ་ཡང་འོད་ཟེར་འབྱུང་བར་འགྱུར་རོ།
en: The great maṇḍala will also emit light.

source: །རིག་སྔགས་འཆང་གཡོ་བར་གྱུར་ནས་ལུས་འབར་བར་འགྱུར་རོ།
en: The body of the vidyā holder will move and blaze with golden light. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་སྐྱ་རེངས་ཤར་ཙམ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཕགས་པ་འོད་དཔག་མེད་གསེར་སྤུངས་པ་ལྟ་བུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་གསེར་གྱི་ཁ་དོག་གིས་རིག་སྔགས་འཆང་གི་མདུན་དུ་བཞུགས་ནས། ཕྱག་གཡས་པ་རིག་སྔགས་འཆང་གི་སྤྱི་བོར་བཞག་ནས།
en: At dawn, the noble Tathāgata Amitābha, a worthy, fully realized buddha, will appear before the vidyā holder in his golden tathāgata body, place his right hand on the vidyā holder’s head, and comfort him.

source: དབུགས་འབྱིན་པར་མཛད་ཅིང་ཡིད་ཀྱི་བརྣག་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མཛད་ནས་མི་གདའ་བར་གྱུར་པ་དང་།
en: He will make all his wishes come true and then disappear.

source: ཤིན་ཏུ་རྣམ་པར་དག་པ་དྲི་མ་མེད་པའི་སྣང་བ་ཞེས་བགྱི་བའི་གཉིད་ཐོབ་ནས།
en: The vidyā holder will subsequently have a dream called stainlessly pure light.

source: ཅི་ལྟར་ཉལ་བ་ཙམ་མམ་མིག་བཙུམ་པ་ཙམ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་གཞལ་མེད་ཁང་དང་།
en: As soon as he goes to sleep and closes his eyes, he will see the realm of Sukhāvatī with its palatial dwellings.

source: གནས་དང་། འཇིག་རྟེན་དང་། ཡུལ་ལྗོངས་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་མཐའ་དག་དང་བཅས་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་རྫོགས་པར་མཐོང་བར་འགྱུར་ལགས་སོ།
en: He will see all the inhabited places in the world and the full assembly of bodhisattvas.

source: །དེ་བཞིན་གཤེགས་པ་དེ་ཆོས་སྟོན་པར་མཛད་པ་ཡང་མཐོང་བར་འགྱུར་ལགས་སོ། །འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དག་ཐམས་ཅད་དབུགས་འབྱིན་པར་བགྱིད་པ་དང་། གཞལ་མེད་ཁང་དང་།
en: He will see the Tathāgata Amitābha teaching the Dharma and giving comfort to everyone in the assembly.

source: རྣམ་པར་འཕྲུལ་པ་དང་། རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་ཐམས་ཅད་མཐོང་བར་འགྱུར་ལགས་སོ།
en: He will see miraculous creations appearing through the power of magic.

source: །འདི་ནས་མ་འོངས་པའི་སྐྱེ་བ་ནས་ཤི་འཕོས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་འགྱུར་རོ།
en: His current birth will be his last birth from the womb, and when he dies he will, as is his destiny, be reborn in the realm of Sukhāvatī.

source: །སྐྱེ་བའི་སྐྱེ་བ་དྲན་པར་འགྱུར་ཏེ་སྐྱེ་བ་བདུན་སྟོང་རྗེས་སུ་དྲན་པར་འགྱུར་རོ།
en: He will retain his memories from one birth to another and be able to recall seven thousand of his former births.

source: །དེ་སད་ནས་ཞགས་པ་ལ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས། ལག་པ་གཡས་པས་གཟུང་ནས། ནམ་མཁའ་ལ་འཕུར་བར་འགྱུར་རོ།
en: If after waking from the dream the vidyā holder incants the noose with the mantra one thousand and eight times and grasps it with his right hand, he will ascend into the sky.

source: །ལོ་ཁྲིར་འཚོ་བར་འགྱུར་རོ། །ཞགས་པ་གྲུབ་པ་རྣམས་དང་། རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ།
en: He will live for ten thousand years and become an emperor of the vidyādharas, all of them the masters of the noose.

source: །འཁོར་ཁྲི་བརྒྱ་སྟོང་དང་ལྡན་པར་འགྱུར་རོ།
en: His retinue will number eighteen thousand. “

source: །པདྨའི་ཞགས་པ་སྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This was the procedure for the practice of the lotus noose. “

source: དེ་ནས་རིག་སྔགས་འཆང་རྡོ་རྗེའི་ཞགས་པ་བསྒྲུབ་པར་འཚལ་ན། ཤིང་ཤུན་དང་། རས་སྐུད་དང་། ཁ་ཆེ་དར་གྱི་སྐུད་པ་མཉམ་དུ་ལྷན་ཅིག་བཀལ་ཏེ། ཁྲུ་ཉི་ཤུ་རྩ་གཅིག་གི་ཚད་ཙམ་དུ་བགྱིས་ལ།
en: If the vidyā holder wants to accomplish the practice of the vajra noose, he should make a thread twenty-one cubits long that combines equal measures of tree-bark fibers, cotton, and silk.

source: ཙན་དན་དཀར་པོ་ལས་རྡོ་རྗེ་སོར་བཞི་བའི་ཚད་དུ་བགྱིས་ཏེ། རྩེ་ལྔ་བ་འབྱུང་པོ་ལ་སོགས་པའི་མགོ་དང་།
en: He should make a vajra that is four fingers long from white sandalwood.

source: སྦྲུལ་གྱི་སྐ་རགས་ཀྱིས་བཅིངས་ལ།
en: The vajra should be five-pronged and bound with a rope made of a nāga with a head.

source: ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོའི་དྲ་བའི་ཕྲེང་བས་དཀྲི་བ་བགྱིས་ནས་ཞགས་པ་ལ་གདགས་པར་བགྱིའོ།
en: It should be garlanded by flames like the nāga king Nandopananda.

source: །དེ་ནས་རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོ་བར་བྱའོ།
en: The vidyā holder should attached the vajra to the noose. “

source: །ལེགས་པར་ཁྲུས་བགྱིའོ། །བའི་རྣམ་ལྔས་ཉེ་རེག་བགྱིའོ།
en: He should be clean, wear clean clothes, bathe thoroughly, and sprinkle himself with the five products of the cow.

source: །རྩྭའི་སྟན་བཏིང་ནས་རི་མོའི་གཟུགས་ཀྱི་མདུན་དུ་ལག་པ་གཡས་པས་ཞགས་པ་མནན་ནས།
en: He should sit on a seat of grass opposite the painting.

source: དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ཁྲི་བཟླས་སོ། །ཁྲོ་བོའི་རྒྱལ་པོའི་སྙིང་པོ་སྟོང་བཟླས་སོ།
en: Pressing down on the noose with his right hand, he should recite the heart mantra of Amoghapāśa ten thousand times and, afterwards, the mantra of Krodharāja one thousand times.

source: །དེ་ནས་ཞགས་པ་དེ་འབར་བར་འགྱུར་ཏེ།
en: The noose will blaze with light.

source: དེ་བཟུང་ནས་ནམ་མཁའ་ལ་འཕུར་བར་འགྱུར་རོ།
en: If he then grasps it, he will ascend into the sky.

source: །རྡོ་རྗེའི་རིགས་དང་། དེ་བཞིན་གཤེགས་པའི་རིགས་དང་། ནོར་བུའི་རིགས་དང་། པདྨའི་རིགས་གང་དག་ལགས་པ་དེ་དག་ཐམས་ཅད་མདུན་ན་བཞུགས་པར་འགྱུར་རོ།
en: All the deities of the vajra, tathāgata, jewel, and lotus families will meet him face-to-face.
